#ifndef __VIDEO_REC__
#define __VIDEO_REC__

#include "app_config.h"
/* ------------------------------------------------------------------------------------*/
/**
 * @brief jlcamera_video_rec_start 启动录像
 *
 * @param filename	录制文件路径
 * @param cyc_time	循环录制(-1不循环)
 *
 * @return
 */
/* ------------------------------------------------------------------------------------*/
int jlcamera_video_rec_start(char *filename, int cyc_time);
/* ------------------------------------------------------------------------------------*/
/**
 * @brief jlcamera_video_rec_stop 暂停录制
 *
 * @return
 */
/* ------------------------------------------------------------------------------------*/
int jlcamera_video_rec_stop();
/* ------------------------------------------------------------------------------------*/
/**
 * @brief jlcamera_video_rec_init 初始化摄像头
 *
 * @return
 */
/* ------------------------------------------------------------------------------------*/
int jlcamera_video_rec_init(void);
/* ------------------------------------------------------------------------------------*/
/**
 * @brief jlcamera_video_rec_deinit
 *
 * @return
 */
/* ------------------------------------------------------------------------------------*/
int jlcamera_video_rec_deinit(void);
/* ------------------------------------------------------------------------------------*/
/**
 * @brief jlcamera_video_rec_refresh_cb 注册刷新回调
 *
 * @param cb ui 刷新回调
 *
 * @return
 */
/* ------------------------------------------------------------------------------------*/
int jlcamera_video_rec_refresh_cb(void (*cb)(int status));

/* ------------------------------------------------------------------------------------*/
/**
 * @brief jlcamera_video_get_task_name 获取线程名
 *
 * @return
 */
/* ------------------------------------------------------------------------------------*/
s8 *jlcamera_video_get_task_name();
#endif //__VIDEO_REC__
